Tekla.Structures.ModelInternal.Operation.ExportModel(System.String,System.String,System.String,System.String,System.String,System.Boolean,Tekla.Structures.ModelInternal.dotCreateTrimBimFromModel_t,System.Action{System.String,System.Int32})
Exports TS model to file.
outPath: Output file name and path.
basePointGuid:
basePointExportType:
exportType:
propertiesPath:
selectedOnly:
info:
progressCb:
Returns: True, if success.

Tekla.Structures.ModelInternal.Operation.StartLiveSharing(Tekla.Structures.Model.Internal.LiveSharingChangeSetDelegate)
Start LiveSharing and return changesets via callback
callback:
Returns: True if successful

Tekla.Structures.ModelInternal.Operation.StopLiveSharing
Stop LiveSharing
Returns:

Tekla.Structures.ModelInternal.Operation.CreateBaseline(System.String)
Create a new baseline
Returns: true if the baseline is created, false otherwise

Tekla.Structures.ModelInternal.Operation.AddChangeSet(System.String,System.String,System.Byte[])
Adds the change set, adjusts the base model to the changes
changeSetName: The change set name
baseModelPath: The base model path
trimbimBlob: The TrimBim blob
Returns: True if the change set is added succesfully, false otherwise

Tekla.Structures.ModelInternal.Operation.RemoveChangeSet(System.String)
Removes the change set
changeSetName: The change set name
Returns: True if the change set is removed successfully, false otherwise

Tekla.Structures.ModelInternal.Operation.GetPendingChangeSets(System.String)
Gets the initial change set that includes all changes prior joining a session
Returns: the initial change set